{
    "type": "FeatureCollection",
    "name": "osm",
    "crs": {
        "type": "name",
        "properties": {
            "name": "urn:ogc:def:crs:OGC:1.3:CRS84"
        }
    },
    "features": [
        {
            "type": "Feature",
            "properties": {
                "name": "Gage Building",
                "description": "{\n  \"street_description\": \"The Gage Building, an architectural gem in Toronto, showcases a blend of historic and modern design. Originally a commercial hub, it now reflects the city’s vibrant culture, hosting artistic events and community gatherings, making it a cornerstone of urban life.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.3971724220458,
                    43.65820818641744
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Health Sciences Building",
                "description": "{\n  \"street_description\": \"Welcome to the Health Sciences Building, a key piece of Toronto's educational landscape. This structure is a testament to modern architecture, blending functionality with eco-friendly design. It's not just a hub for health education, but a symbol of the city's commitment to innovation in healthcare.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39276357324219,
                    43.65908133672663
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "University of Toronto Communications House",
                "description": "{\n  \"street_description\": \"Welcome to the University of Toronto, home to Communications House! This architectural gem showcases modern educational design infused with rich academic history. Explore the vibrant culture filled with innovation, learning, and diverse student life. A true urban landmark!\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39356648328842,
                    43.65889051853134
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Caretaking",
                "description": "{\n  \"street_description\": \"As you stroll down Caretaking, you'll find a blend of modern and historical architecture. This area reflects Toronto's evolving urban culture, where contemporary designs meet remnants of the city's past. It's a symbol of community care and urban living in harmony!\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39358298745042,
                    43.65857343901554
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Central Exams Facility",
                "description": "{\"street_description\":\"Welcome to the Central Exams Facility, a hub of education concentrated in Toronto’s vibrant district. This modern building reflects the city’s commitment to academic excellence, featuring contemporary design intertwined with a rich cultural backdrop of learning and community engagement.\"}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.3928318920115,
                    43.65847492346394
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Old Admin Building",
                "description": "{\n  \"street_description\": \"Welcome to the Old Admin Building, a significant piece of Toronto's architectural heritage! This historic structure reflects early 20th-century design with its robust masonry and elegant detailing. It symbolizes the city’s administrative evolution and serves as a reminder of its rich cultural legacy.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39251548788762,
                    43.65878649002416
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Sharp Centre for Design",
                "description": "{\n  \"street_description\": \"Welcome to the Sharp Centre for Design, an architectural gem in Toronto! This striking building, designed by Will Alsop, features a colorful, cantilevered structure that challenges conventional design. It symbolizes the city's vibrant culture and innovation in design education.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39118465137535,
                    43.65295909226768
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Stewart Building",
                "description": "{\n  \"street_description\": \"Welcome to the Stewart Building! This iconic structure combines historic charm with modern usage, showcasing Toronto's architectural evolution. Once bustling with commerce, it reflects the city’s rich cultural tapestry, embodying a blend of Victorian and contemporary design.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39199307982378,
                    43.65921116317268
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Rosalie Sharp Pavilion",
                "description": "{\n  \"street_description\": \"Welcome to the Rosalie Sharp Pavilion, a stunning example of modern architecture nestled in the heart of Toronto. Opened in the 21st century, it reflects the city's commitment to public art and green spaces, serving as both a cultural hub and a serene escape amidst urban vibrancy.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39114096194673,
                    43.65413645922323
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Inclusive Design Institute",
                "description": "{\n  \"street_description\": \"Welcome to the Inclusive Design Institute, a beacon of innovation in Toronto. This facility focuses on accessibility and inclusive design, merging modern architecture with community spirit. As you stroll past, notice how the environment fosters engagement for all, reflecting our diverse city's values.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39005381511942,
                    43.65174756527598
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "OCAD Student Centre",
                "description": "{\n  \"street_description\": \"Welcome to the OCAD Student Centre, a vibrant hub of creativity and culture! This modern building, marked by its bold, angular design, showcases OCAD University's commitment to art and design. Here, students collaborate, creating a dynamic atmosphere that reflects Toronto's innovation.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39017673124282,
                    43.65179517316639
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Main Building",
                "description": "{\n  \"street_description\": \"Welcome to the Main Building, a historic landmark that embodies Toronto's architectural evolution. This structure showcases a blend of neoclassical and modern designs, reflecting the city's rich educational and cultural heritage. Stroll through its grounds and feel the city's vibrant history!\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39148303846703,
                    43.65328625201162
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "285 Dundas Street West",
                "description": "{\n  \"street_description\": \"Welcome to 285 Dundas Street West! This vibrant area showcases a mix of cultural influences and architectural styles, highlighting Toronto’s evolution. You'll find historic buildings alongside commercial spaces, reflecting the city’s growth while serving as a hub for diverse communities.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.39089521279955,
                    43.65418734878665
                ]
            }
        },
        {
            "type": "Feature",
            "properties": {
                "name": "Annex Building",
                "description": "{\n  \"street_description\": \"Welcome to the Annex Building! This vibrant area, known for its Victorian architecture, reflects the cultural diversity of Toronto. Originally developed in the late 19th century, the Annex is a hub for artists, students, and intellectuals, showcasing eclectic homes and charming streets.\"\n}"
            },
            "geometry": {
                "type": "Point",
                "coordinates": [
                    -79.390168246299,
                    43.6535028438777
                ]
            }
        }
    ]
}